code-review/NRB_3471_3546/База_Было/BusinessProcesses/ФормированиеУслугПоУчетуЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>ФормированиеУслугПоУчетуЦБ</Name>
			<Task>Task.Пустышка</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачисленияКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаКотировок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомиссииВнешнихДепозитариев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СформированныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УслугиДепозитария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВариантыНачисленияКомиссий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыНачисленияКомиссий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяПериодичность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/УслугиДепозитария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УслугиДепозитария</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/BusinessProcesses/ФормированиеУслугПоУчетуЦБ/Ext/ObjectModule.bsl
Процедура СбросПроцесса() Экспорт
	Стартован = Ложь;
	Завершен  = Ложь;
	Для Каждого Элемент из СформированныеДокументы Цикл
		Док = Элемент.Документ.ПолучитьОбъект();
		Док.Удалить();
	КонецЦикла;
	Комиссии.Очистить();
	СформированныеДокументы.Очистить();
	Записать();
КонецПроцедуры

Процедура РасчетКомиссийОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Комиссии.Очистить();
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецМесяца(ДатаНачисленияКомиссии) Тогда
		РассчитатьКомиссииЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Месяц);
	КонецЕсли;
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецКвартала(ДатаНачисленияКомиссии) Тогда
		РассчитатьКомиссииЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Квартал);
	КонецЕсли;
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецМесяца(ДатаНачисленияКомиссии)
		И (Месяц(ДатаНачисленияКомиссии) = 6
			ИЛИ Месяц(ДатаНачисленияКомиссии) = 12) Тогда
		РассчитатьКомиссииЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Полугодие);
	КонецЕсли;
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецГода(ДатаНачисленияКомиссии) Тогда
		РассчитатьКомиссииЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Год);
	КонецЕсли;
	
	Комиссии.Сортировать("Договор,Комиссия");
	Записать();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ФормированиеУслугПоУчетуЦБ_РасчетКомиссий", ВремяНачалаЗамера);
	
КонецПроцедуры

Функция НачалоПериодаПоВариантуНачисленияКомиссий(ПериодРасчета)
	Если ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Месяц Тогда
		НачалоПериода = НачалоМесяца(ДатаНачисленияКомиссии);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Квартал Тогда
		НачалоПериода = НачалоКвартала(ДатаНачисленияКомиссии);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Полугодие Тогда
		ВтороеПолугодие = 7;
		НачалоПериода = Дата(Год(ДатаНачисленияКомиссии), ?(Месяц(ДатаНачисленияКомиссии) < ВтороеПолугодие, 1, ВтороеПолугодие), 1);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Год Тогда
		НачалоПериода = НачалоГода(ДатаНачисленияКомиссии);
	Иначе
		НачалоПериода = НачалоДня(ДатаНачисленияКомиссии);
	КонецЕсли;
	Возврат НачалоПериода;
КонецФункции

Процедура РассчитатьКомиссииЗаПериод(ПериодРасчета)
	ТипыРасчетаХранениеЦБ = Новый Массив;
	ТипыРасчетаХранениеЦБ.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоВыпуску);
	ТипыРасчетаХранениеЦБ.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоРыночнойСтоимости);
	ТипыРасчетаХранениеЦБ.Добавить(Перечисления.ТипыРасчетаУслуги.ОценкаРыночнойСтоимостиЗаМесяц);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Комиссии.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК Комиссии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РегистрНазначенныхКомиссий.Период) КАК ПериодНазначенияКомиссии,
	|			РегистрНазначенныхКомиссий.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|			РегистрНазначенныхКомиссий.Услуга КАК Услуга
	|		ИЗ
	|			РегистрСведений.РегистрНазначенныхКомиссий КАК РегистрНазначенныхКомиссий
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Календарь.Период КАК Период
	|				ИЗ
	|					РегистрСведений.Календарь КАК Календарь
	|				ГДЕ
	|					Календарь.Период МЕЖДУ &НачалоПериода И &Дата) КАК Календарь
	|				ПО РегистрНазначенныхКомиссий.Период <= Календарь.Период
	|					И (РегистрНазначенныхКомиссий.ДоговорКонтрагента.Владелец ССЫЛКА Справочник.Контрагенты)
	|					И (РегистрНазначенныхКомиссий.Услуга.ПериодРасчета = &ПериодРасчета)
	|					И (РегистрНазначенныхКомиссий.Услуга.ТипРасчета В (&ТипыРасчетаХранениеЦБ))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РегистрНазначенныхКомиссий.ДоговорКонтрагента,
	|			РегистрНазначенныхКомиссий.Услуга,
	|			Календарь.Период) КАК РегистрНазначенныхКомиссийПоКалендарю
	|		ПО Комиссии.Период = РегистрНазначенныхКомиссийПоКалендарю.ПериодНазначенияКомиссии
	|			И Комиссии.ДоговорКонтрагента = РегистрНазначенныхКомиссийПоКалендарю.ДоговорКонтрагента
	|			И Комиссии.Услуга = РегистрНазначенныхКомиссийПоКалендарю.Услуга
	|			И (Комиссии.ФлагАктивности = ИСТИНА)";
	
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериодаПоВариантуНачисленияКомиссий(ПериодРасчета));
	Запрос.УстановитьПараметр("Дата",					ДатаНачисленияКомиссии);
	Запрос.УстановитьПараметр("ПериодРасчета",			ПериодРасчета);
	Запрос.УстановитьПараметр("ТипыРасчетаХранениеЦБ",	ТипыРасчетаХранениеЦБ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
		Состояние("Расчет комиссий по услуге " + Выборка.Услуга);
		#КонецЕсли
		РезультатЗапроса = РасчетТарифов.ОценкаАктивов(ДатаНачисленияКомиссии,, Выборка.Услуга, ПериодРасчета);
		ВыборкаРезультатов = РезультатЗапроса.Выбрать();
		Пока ВыборкаРезультатов.Следующий() Цикл
			НоваяСтрока = Комиссии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатов); 
		КонецЦикла;
	КонецЦикла;
	
	ТипыРасчетаВедениеСчетаДепо = Новый Массив;
	ТипыРасчетаВедениеСчетаДепо.Добавить(Перечисления.ТипыРасчетаУслуги.КоличествоСчетовДЕПО);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комиссии.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Комиссии.ДоговорКонтрагента.Код КАК ДоговорКонтрагентаКод,
	|	Комиссии.Услуга КАК Услуга,
	|	Комиссии.Услуга.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
	|			&Дата,
	|			Услуга.ПериодРасчета = &ПериодРасчета
	|				И ДоговорКонтрагента.Владелец ССЫЛКА Справочник.Контрагенты
	|				И Услуга.ТипРасчета В (&ТипыРасчетаВедениеСчетаДепо)) КАК Комиссии
	|ГДЕ
	|	Комиссии.ФлагАктивности
	|
	|УПОРЯДОЧИТЬ ПО
	|	Комиссии.ДоговорКонтрагента.Код";
	Запрос.УстановитьПараметр("ТипыРасчетаВедениеСчетаДепо", ТипыРасчетаВедениеСчетаДепо);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
		Состояние("Расчет комиссий по договору " + Выборка.ДоговорКонтрагентаКод);
		#КонецЕсли
		РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(КонецДня(ДатаНачисленияКомиссии),
			Выборка.ДоговорКонтрагента, Выборка.Услуга, ПериодРасчета);  
			
		Если ТипЗнч(РасчетныеПараметры) = Тип("Структура")
			И (РасчетныеПараметры.СуммаКомиссии <> 0 ИЛИ РасчетныеПараметры.Сумма <> 0) Тогда
			НоваяСтрока = Комиссии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасчетныеПараметры);
			НоваяСтрока.Валюта		= Выборка.Валюта;
			НоваяСтрока.Договор		= Выборка.ДоговорКонтрагента;
			НоваяСтрока.Комиссия	= Выборка.Услуга;
			
		ИначеЕсли ТипЗнч(РасчетныеПараметры) = Тип("ТаблицаЗначений") Тогда
			Для Каждого РасчетныйПараметр Из РасчетныеПараметры Цикл
				Если РасчетныйПараметр.СуммаКомиссии <> 0 ИЛИ РасчетныйПараметр.Сумма <> 0 Тогда
					НоваяСтрока = Комиссии.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, РасчетныйПараметр);
					НоваяСтрока.Валюта		= Выборка.Валюта;
					НоваяСтрока.Договор		= Выборка.ДоговорКонтрагента;
					НоваяСтрока.Комиссия	= Выборка.Услуга;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ФормированиеДокументовОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	СформироватьДокументыПоДаннымИзТабличнойЧасти(Комиссии);
	
	СформироватьДокументыПоДаннымИзТабличнойЧасти(КомиссииВнешнихДепозитариев);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ФормированиеУслугПоУчетуЦБ_ФормированиеДокументов", ВремяНачалаЗамера);
	
КонецПроцедуры

Процедура СформироватьДокументыПоДаннымИзТабличнойЧасти(ТабличнаяЧасть)
	ЭтоКомиссииВнешнихДепозитариев = (ТабличнаяЧасть = КомиссииВнешнихДепозитариев);
	
	ТекДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	УслугиДепозитария = Неопределено;
	Для Каждого Элемент Из ТабличнаяЧасть Цикл
		Если Элемент.СуммаКомиссии = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Элемент.Договор <> ТекДоговор Тогда
			Если НЕ УслугиДепозитария = Неопределено Тогда
				УслугиДепозитария.СуммаВсего = УслугиДепозитария.Услуги.Итог("СуммаКомиссии");
				УслугиДепозитария.Записать(РежимЗаписиДокумента.Проведение);
				БП_НС = СформированныеДокументы.Добавить();
				БП_НС.Документ = УслугиДепозитария.Ссылка;
			КонецЕсли;
			ТекДоговор = Элемент.Договор;
			УслугиДепозитария = Документы.УслугиДепозитария.СоздатьДокумент();
			УслугиДепозитария.Дата = ТекущаяДатаСеанса();
			УслугиДепозитария.УстановитьНовыйНомер();
			УслугиДепозитария.Договор = Элемент.Договор;
			УслугиДепозитария.Контрагент = Элемент.Договор.Владелец;
			УслугиДепозитария.ПериодРасчетаКомиссии = ДатаНачисленияКомиссии;
			
			#Если Клиент Тогда
			Состояние("Формирование документа услуг депозитария по договору " + Элемент.Договор);
			#КонецЕсли
		КонецЕсли;
		НС = УслугиДепозитария.Услуги.Добавить();
		НС.Валюта = Элемент.Валюта;
		НС.ВидОперации = Элемент.Комиссия.Операция;
		НС.ТипТарифа = Элемент.ТипТарифа;
		НС.Услуга = Элемент.Комиссия;
		НС.СуммаСделки = Элемент.Сумма;
		НС.СуммаКомиссии = Элемент.СуммаКомиссии;
		НС.МестоХранения = ?(ТипЗнч(Элемент.Договор.Владелец)=Тип("СправочникСсылка.МестаХранения"),Элемент.Договор.Владелец,Справочники.МестаХранения.ПустаяСсылка());
		Если ЭтоКомиссииВнешнихДепозитариев Тогда
			НС.Тариф = Элемент.СуммаКомиссии;
		Иначе
			НС.Тариф = Элемент.Тариф;
			НС.Выгодоприобретатель = Элемент.Выгодоприобретатель;
		КонецЕсли;
	КонецЦикла;
	Если НЕ УслугиДепозитария = Неопределено Тогда
		УслугиДепозитария.СуммаВсего = УслугиДепозитария.Услуги.Итог("СуммаКомиссии");
		УслугиДепозитария.Записать(РежимЗаписиДокумента.Проведение);
		БП_НС = СформированныеДокументы.Добавить();
		БП_НС.Документ = УслугиДепозитария.Ссылка;
	КонецЕсли;
	
	Записать();
КонецПроцедуры

Процедура РасчетКомиссийВнешнихДепозитариевОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	КомиссииВнешнихДепозитариев.Очистить();
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецМесяца(ДатаНачисленияКомиссии) Тогда
		РассчитатьКомиссииВнешнихДепозитариевЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Месяц);
	КонецЕсли;
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецКвартала(ДатаНачисленияКомиссии) Тогда
		РассчитатьКомиссииВнешнихДепозитариевЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Квартал);
	КонецЕсли;
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецМесяца(ДатаНачисленияКомиссии)
		И (Месяц(ДатаНачисленияКомиссии) = 6
			ИЛИ Месяц(ДатаНачисленияКомиссии) = 12) Тогда
		РассчитатьКомиссииВнешнихДепозитариевЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Полугодие);
	КонецЕсли;
	
	Если КонецДня(ДатаНачисленияКомиссии) = КонецГода(ДатаНачисленияКомиссии) Тогда
		РассчитатьКомиссииВнешнихДепозитариевЗаПериод(Перечисления.ВариантыНачисленияКомиссий.Год);
	КонецЕсли;

	Записать();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ФормированиеУслугПоУчетуЦБ_РасчетКомиссийВнешнихДепозитариев", ВремяНачалаЗамера);
	
КонецПроцедуры

Процедура РассчитатьКомиссииВнешнихДепозитариевЗаПериод(ПериодРасчета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комиссии.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Комиссии.Услуга КАК Услуга,
	|	Комиссии.Услуга.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
	|			&Дата,
	|			Услуга.ПериодРасчета = &ПериодРасчета
	|				И ДоговорКонтрагента.Владелец ССЫЛКА Справочник.МестаХранения) КАК Комиссии
	|ГДЕ
	|	Комиссии.ФлагАктивности
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорКонтрагента";
	Запрос.УстановитьПараметр("Дата",			ДатаНачисленияКомиссии);
	Запрос.УстановитьПараметр("ПериодРасчета",	ПериодРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(ДатаНачисленияКомиссии,
			Выборка.ДоговорКонтрагента, Выборка.Услуга, ПериодРасчета);  
		Если ТипЗнч(РасчетныеПараметры) = Тип("Структура") Тогда
			НоваяСтрока = КомиссииВнешнихДепозитариев.Добавить();
			НоваяСтрока.Договор			= Выборка.ДоговорКонтрагента;
			НоваяСтрока.Комиссия		= Выборка.Услуга;
			НоваяСтрока.СуммаКомиссии	= РасчетныеПараметры.Сумма;
			НоваяСтрока.Сумма			= РасчетныеПараметры.Объем;
			НоваяСтрока.Валюта			= Выборка.Валюта;
			НоваяСтрока.ТипТарифа		= РасчетныеПараметры.ТипТарифа;
			
		ИначеЕсли ТипЗнч(РасчетныеПараметры) = Тип("ТаблицаЗначений") Тогда
			Для Каждого РасчетныйПараметр Из РасчетныеПараметры Цикл
				НоваяСтрока = КомиссииВнешнихДепозитариев.Добавить();
				НоваяСтрока.Договор			= Выборка.ДоговорКонтрагента;
				НоваяСтрока.Комиссия		= Выборка.Услуга;
				НоваяСтрока.СуммаКомиссии	= РасчетныйПараметр.Сумма;
				НоваяСтрока.Сумма			= РасчетныйПараметр.Объем;
				НоваяСтрока.Валюта			= Выборка.Валюта;
				НоваяСтрока.ТипТарифа		= РасчетныйПараметр.ТипТарифа;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Завершен = Ложь;
	Стартован = Ложь;
	СформированныеДокументы.Очистить();
	Комиссии.очистить();
	КомиссииВнешнихДепозитариев.Очистить();
КонецПроцедуры
